* Background
I implement something like GTD ('getting things done')
personal organization system with EMACS Org mode. I thought
it'd be useful to mine my agenda files for a summary of what
I'm usually up to. Because when asked, I always think,
'well, I dunno - it's in my org files/agenda. I find it hard to put all
of it in accessible memory, if you will. I just execute it.'.


* Setup data and readme
  - /data for data (in my case, symlinks to org files)
  - README.rmd

#+begin_src sh
mkdir data
touch analysis.Rmd
#+end_src


* Setup git
  - initialize
  - create remote repo
  - setup gitignore
  - set upstream remote
  - commit and push

#+begin_src sh
echo 'data/*' >> .gitignore
# git remote add origin git@github.com:jo-tham/org_text_miner.git
# git push -u origin master
#+end_src


* Symlink org files
  - putting them in subdirectories so it's easier to create
    analysis per file, as the sourcing of single files into
    corpus is difficult with the R tm package
  - also put all in the root data directory for the combined
    analysis, since recursive argument dir dirSource is
    failing me
  - symlink to all org files
    - in the future could do all org files on machine by
      using a find command

#+begin_src sh
ln -s ~/projects/9999-99-99_master/*.org ~/projects/9999-99-99_master_text_miner/data
ls -a ~/projects/9999-99-99_master_text_miner/data
#+end_src

#+RESULTS:
| .                |
| ..               |
| computing.org    |
| fynanse.org      |
| personal.org     |
| physical.org     |
| professional.org |
| reading.org      |
| website.org      |

#+begin_src sh
cd ~/projects/9999-99-99_master
for i in *.org; do
projDir="/home/$USER/projects/9999-99-99_master_text_miner/data/$i"
projDirXext="${projDir%.org}"
mkdir -p -- "$projDirXext" && cp "$i" "$projDirXext/$i"
done
#+end_src

#+RESULTS:


* References/acknowledgements
  - [[https://gist.github.com/jnrbsn/708961][GPL-3 markdown]]
